app/controllers/coauthors_controller.rb

INSERT INTO "coauthors" ("updated_at", "lemma_id", "user_id", "activion", "created_at") VALUES('2010-06-19 03:38:10', 3, 4, 'f', '2010-06-19 03:38:10')
---
  def create
    if @coauthor.save

SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 1)
---
  def load_coauthor
    @lemma = Lemma.find(params[:lemma_id])