app/controllers/lemmas_controller.rb

SELECT * FROM "lemmas"
---
  def index
    @lemmas = Lemma.all

SELECT * FROM "lemmas" LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "lemmas"
---
  def tag
    options = Lemma.find_options_for_find_tagged_with(params[:id],
                                                                                  :order => "updated_at DESC").merge(:page => params[:page] ||1,
                                                                                  :per_page =>3 )
     @lemmas = Lemma.paginate(options)

INSERT INTO "tags" ("name") VALUES('rails')
---
  def add_tag
    @lemma.tag_list.add params[:tag]
    @lemma.save_tags

INSERT INTO "lemmas" ("updated_at", "title", "body", "cache_tag_list", "point", "created_at") VALUES('2010-06-18 10:45:05', '燕子不再的地方', 'As a teenager, flip flops were a staple for me in the summer. I would go through a pair or two each season. But as I got older, I stopped wearing flip flops. Why? Well, for starters, I realized that men have really ugly feet and that most people probably don’t want to see my ugly man toes all the time. Additionally, flip flops just became too casual and adolescent for my maturing style sensibilities. As I started to dress more “grown-up,” flip flops didn’t seem to fit in anymore. Now I only wear them when I’m going to the pool or the beach.
INSERT INTO "coauthors" ("updated_at", "lemma_id", "user_id", "activion", "created_at") VALUES('2010-06-18 04:04:44', 1, 3, 't', '2010-06-18 04:04:44')
---
  def create
    @lemma = Lemma.new params[:lemma]
    if @lemma.save
      #为词条的创建者添加积分。
      coauthor =  Coauthor.create!(:lemma => @lemma,:user => current_user,:activion => true)

UPDATE "lemmas" SET "point" = 50, "updated_at" = '2010-06-19 04:03:16' WHERE "id" = 5
SELECT * FROM "coauthors" WHERE ("coauthors"."user_id" = 3 AND "coauthors"."lemma_id" = 5) LIMIT 1
UPDATE "coauthors" SET "activion" = 't', "updated_at" = '2010-06-19 04:03:16' WHERE "id" = 8
UPDATE "users" SET "point" = 65, "updated_at" = '2010-06-19 04:03:16' WHERE "id" = 3
---
  def update
    if @lemma.update_attributes(params[:lemma])
      coauthor = Coauthor.find_by_user_id_and_lemma_id current_user.id,@lemma.id
      #只为后来的编辑者添加积分。
      #activation 为 true，表示在这词条上，该作者已被奖励过了！
      coauthor.user.increment!(:point,@lemma.point) unless coauthor.active?

DELETE FROM "lemmas" WHERE "id" = 1
---
  def destroy
    @lemma.destroy

SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 5)
---
  def load_lemma
    @lemma = Lemma.find params[:id]