app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "roles", "updated_at", "crypted_password", "remember_token_expires_at", "point", "remember_token", "login", "email", "created_at") VALUES('', '03d7fe564ee330eba17a099b5b1b013700a20988', 'fbplayer', '2010-06-19 04:04:46', '3eabe1d76aca84f6687cf3e29cbf20be9d038617', NULL, 0, NULL, '林慧敏', 'linhuimin@glorisun.com', '2010-06-19 04:04:46')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "roles" = 'Sponsor', "updated_at" = '2010-06-17 07:04:06' WHERE "id" = 1

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "id" = 1

  def load_user
    @user = User.find params[:id]
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1